{"Sheet1":[{"step":"90-day notification to Congress of intention to begin negotiations","related":"https://subscriber.politicopro.com/transportation/whiteboard/2017/05/ustr-sends-congress-formal-notice-to-reopen-nafta-087900","category":"Negotiation","here":"past","note":"The first step was formally notifying Congress that the U.S. planned to launch the re-negotiation process with Canada and Mexico. U.S. Trade Representative Robert Lighthizer first met with four congressional committees — Senate Finance, House Ways and Means, and an advisory group from each chamber — before sending the formal letter to Capitol Hill on May 18 of last year.","sideKey":false},{"step":"Negotiations begin","related":"https://subscriber.politicopro.com/agriculture/story/2017/08/us-sets-tough-tone-with-canada-mexico-as-nafta-renegotiation-starts-160804","category":"Negotiation","here":"past","note":"The administration formally launched negotiations on the first day that they could — August 16, exactly 90 days after sending the formal notification to Congress of their intent to do so. The three parties met in Washington for five days of talks that exposed deep differences among the countries on each of their goals for the renegotiation.","sideKey":false},{"step":"180-day notification prior to signing agreement of potential changes to U.S. trade remedy laws","related":"https://www.politicopro.com/trade/story/2017/09/ustr-signals-new-nafta-deal-could-be-signed-in-march-162402","category":"Negotiation","here":"past","note":"The trade office took a step toward paving the way to vote on the updated deal early in 2018 when it formally notified Congress in September that it expected changes to U.S. trade remedy laws would be coming. That step is required 180 days before any agreement can be signed, so the decision to send notice back on Sept. 24 indicated the administration was hopeful at that point that it might have been able to sign a deal as early as March 22.","sideKey":false},{"step":"Negotiations conclude","category":"Negotiation","here":"here","note":"Negotiators from the three countries have been meeting regularly since talks began in August, and while they have closed a handful of chapters of the agreement they have yet to make substantial progress on any of the most controversial and highest-profile issues. After holding seven formal negotiating rounds that rotated among venues in each of the three countries, negotiators — and often trade ministers too — have been meeting consistently in Washington in an attempt to wrap up talks as quickly as possible.","sideKey":false},{"step":"90-day notification of intent to sign agreement","category":"Negotiation","here":"no","note":"The next step after negotiations conclude — or as they are nearing their finish — is for the U.S. to formally notify Congress that it intends to sign a new deal. House Speaker Paul Ryan made headlines when he said in May that Congress would need that paper in hand by May 17 if the administration wanted any hope of passing the agreement through the current Congress, but he later said there was “some wiggle room” on that deadline.","sideKey":false},{"step":"30 days after notification of intention to sign, submission of Advisory Committee reports","category":"Negotiation","here":"no","note":"TPA calls for the formation of a handful of advisory groups comprised of representatives from local and state governments, agriculture, industry and elsewhere who help ensure that private and public stakeholders have a say over trade policy. No later than 30 days after notifying Congress that it intends to sign the agreement, the U.S. trade office is required to submit to Congress from the various committees reports detailing their views on the potential impacts of an agreement.","sideKey":false},{"step":"60 days prior to signing, release of agreement text","category":"Negotiation","here":"no","note":"The administration is required to make the text of the updated deal publicly available 60 calendar days before it plans to sign the agreement.","sideKey":"Reporting and mock markup"},{"step":"Agreement signed","category":"Reporting and mock markup","here":"no","sideKey":false},{"step":"60 days after agreement is signed, list of required changes in law due","category":"Reporting and mock markup","here":"no","note":"The administration will have up to 60 calendar days after the signing of the agreement to submit a list of changes to U.S. law that will be needed in order for the deal to take effect. ","sideKey":false},{"step":"105 days after agreement is signed, U.S. ITC report due","category":"Reporting and mock markup","here":"no","note":"The U.S. International Trade Commission is required to complete a report assessing the potential economic impact of the agreement, which must be made public. The requirement is one of the most flexible of all of those outlined under TPA: The ITC has up to 105 days after the agreement is signed to submit its report, but it could do so sooner. Some experts also believe the ITC can begin its analysis even before the agreement is signed, because the president is required to submit to the commission the details of the proposed deal 90 days prior to signing.","sideKey":false},{"step":"30 days prior to implementing legislation, final text and draft SAA submitted","category":"Reporting and mock markup","here":"no","note":"The administration must submit to Congress the final text of the implementing legislation and a draft Statement of Administrative Action 30 days before it is formally introduced.","sideKey":false},{"step":"Mock markups (optional, no time schedule)","category":"Reporting and mock markup","here":"no","note":"The Senate Finance Committee and House Ways and Means Committee may provide advice to the administration on the contents of the implementing bill by holding hearings and a mock conference on the draft version. Though not required by statute, the advisory process is generally used as a way for Congress to communicate its preferences to the administration before the formal bill is put forward.","sideKey":"Congressional Consideration and implementation"},{"step":"Implementing bill introduced in House and Senate","category":"Congressional Consideration and implementation","here":"no","note":"The Ways and Means and Finance Committees may take up to 45 days in session to report the bill back to the floor, and they may not amend it nor can they recommend amendments. If they do not report the bill after 45 session days it will be automatically discharged to the floor.","sideKey":false},{"time":"Could take 45 days","step":"House Ways and Means must report bill","category":"Consideration and implementation","here":"no","note":"Because most trade agreements affect tariffs, the implementing bill will be considered a revenue bill, which requires the House to act first.","sideKey":false},{"time":"Could take 15 days","step":"House must vote on bill","category":"Congressional Consideration and implementation","here":"no","note":"The bill may be called up for consideration by any member of the House, and then debate will be limited to 20 hours. The bill needs support from a majority of members voting to pass, at which point it will go to the Senate.","sideKey":false},{"time":"Could take 15 days","step":"Senate Finance Committee must report bill","category":"Congressional Consideration and implementation","here":"no","note":"The Finance committee will have up to 15 session days to consider the House bill before it is discharged.","sideKey":false},{"time":"Could take 15 days","step":"Senate must vote on bill","category":"Congressional Consideration and implementation","here":"no","note":"Because neither chamber is allowed to add amendments to the bill, the version the Senate has received from the House will be identical to the one the Senate received initially. Any senator can then call up the bill for consideration without waiting for action from the majority leader. Debate is again limited to 20 hours and the bill can be passed with support from a majority of members voting.","sideKey":false},{"step":"Bill signed into public law","category":"Congressional Consideration and implementation","here":"no"},{"step":"President implements agreement by proclamation","category":"Congressional Consideration and implementation","here":"no"}]}
